<<<<<<< HEAD
<<<<<<< HEAD
#include "all.h"
using namespace GameLib::input;


void SceneTitle::init()
{
    state = 0;
}

void SceneTitle::update()
{
    switch (state)
    {
    case 0:
        ++state;
        break;
    case 1:
        if (TRG(0) & PAD_START)
            setScene(SCENE::GAME);
=======
//******************************************************************************
//
//
//      タイトル
//
//
//******************************************************************************

//------< インクルード >----------------------------------------------------------
#include "all.h"

//------< using >---------------------------------------------------------------
using namespace GameLib;

//------< 変数 >----------------------------------------------------------------
Title Title::instance_;

//--------------------------------------------------------------
//  更新処理
//--------------------------------------------------------------
void Title::update()
{
    using namespace input;

    switch (state_)
    {
    case 0:
        //////// 初期設定 ////////

        timer_ = 0;                                  // タイマーを初期化
        GameLib::setBlendMode(Blender::BS_ALPHA);   // 通常のアルファ処理
        state_++;                                    // 初期化処理の終了

        /*fallthrough*/                             // 意図的にbreak;を記述していない

    case 1:
        //////// 通常時の処理 ////////


        //if (TRG(0) & PAD_START)             // PAD_TRG1が押されたら
        //    changeScene(Game::instance());  // ゲームシーンに切り替え


        timer_++;                            // タイマーを足す
>>>>>>> 23c190ec252f7c8ce4c78606a1c372ff6cc960f8
        break;
    }
}

<<<<<<< HEAD
void SceneTitle::draw()
{
    debug::setString("TITLE");
}
=======
>>>>>>> f27f2d22d2f22a679c54ef9cb6aa2ff1c2bc980a
=======
//--------------------------------------------------------------
//  描画処理
//--------------------------------------------------------------
void Title::draw()
{
    // 画面クリア
    GameLib::clear(VECTOR4(0.2f, 0.3f, 1.0f, 1));
    

}

//******************************************************************************
>>>>>>> 23c190ec252f7c8ce4c78606a1c372ff6cc960f8
